package main
import "fmt"

func insertSort(ary []int) {
  // 仮引数配列の要素分繰り返す
  for i := 1; i < len(ary); i++ {
    fmt.Println("i", i)
    // 現在の添え字要素の値を取り出す
    tmp := ary[i]
    // 現在の添え字の一つ前から始めて、
    j := i - 1
    // 配列の頭まで、1要素ずつ、現在の添え字要素の値と比べて大きい場合
    for ; j >= 0 && ary[j] > tmp; j-- {
    fmt.Println("j", j)
      //
      ary[j + 1] = ary[j]
      fmt.Println(ary)
    }
    ary[j + 1] = tmp
    fmt.Println(ary)
  }
}

func main() {
  a := []int{12,43,36,73,67,32,100}
  fmt.Println(a)
  insertSort(a)
  fmt.Println(a)
}

//以下、実行結果
// [12 43 36 73 67 32 100]
//
// i 1
// [12 43 36 73 67 32 100]
//
// i 2
// j 1
// [12 43 43 73 67 32 100]
// [12 36 43 73 67 32 100]
//
// i 3
// [12 36 43 73 67 32 100]
//
// i 4
// j 3
// [12 36 43 73 73 32 100]
// [12 36 43 67 73 32 100]
//
// i 5
// j 4
// [12 36 43 67 73 73 100]
// j 3
// [12 36 43 67 67 73 100]
// j 2
// [12 36 43 43 67 73 100]
// j 1
// [12 36 36 43 67 73 100]
// [12 32 36 43 67 73 100]
//
// i 6
// [12 32 36 43 67 73 100]
// [12 32 36 43 67 73 100]
